tutorials/elastic_cases/oscillating_core/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

regions
(
     boxToCell
    {
        box (0 0 -0.2) (1.125 2.335 0.2); 
        fieldValues
        (
            volScalarFieldValue alpha.wetting 1
        );
    }
    boxToCell
    {
        box (0 0 -0.2) (10 1.63 0.2);
        fieldValues
        (
            volScalarFieldValue alpha.wetting 1
        );
    }
);


// ************************************************************************* //
